[
    

    {
        "title": "Interactive Road Accident Analysis Dashboard",
        "description": "Designed and implemented an interactive Excel dashboard to drive data-led road safety decisions.",
        "tools": ["Excel PivotTables", "Power Query", "Advanced Charts", "Dashboard Design", "Data Validation"],
        "github": "https://github.com/MussaratBano/Road-Accident-Dashboard.git",
        "slug": "road-accident-analysis-dashboard",
        "content": "<h2 style=\"color:navy;\">Turning 307,000+ Rows of Raw Data into Life-Saving Insights 🚗📊</h2><p>I’m thrilled to share my latest project: <strong>a comprehensive Road Accident Analysis Dashboard</strong> built entirely in <strong>Excel</strong>. This isn’t just a spreadsheet—it’s a dynamic <strong>command centre</strong> designed for stakeholders like the <strong>Ministry of Transport</strong> and <strong>Police</strong> to drive data-led safety decisions.</p><h3>The Challenge</h3><p>The main challenge was processing a massive dataset of <strong>307,000 records</strong> across <strong>2024</strong> and <strong>2025</strong> to identify critical road safety trends. Raw data is noisy—so I performed rigorous <strong>data cleaning</strong> (correcting typos and handling missing values) and <strong>data processing</strong> to extract monthly and yearly trends.</p><h3>Key Project Highlights</h3><ol><li><strong>Primary KPIs:</strong> High-impact visibility of total casualties, accident severity (<em>Fatal, Serious, Slight</em>), and the vehicle types most involved.</li><li><strong>Year-on-Year (YoY) Analysis:</strong> Monthly trend charts comparing current vs. previous year performance to spot seasonal spikes.</li><li><strong>Granular Insights:</strong> Deep dives into casualties by road surface, light conditions, and area type (<em>Urban vs. Rural</em>).</li><li><strong>Fully Interactive UI:</strong> Integrated <strong>Slicers</strong>, allowing users to filter <strong>300k+</strong> rows of data in a single click for instant reporting.</li><li><strong>The Tech Stack:</strong> Advanced Excel, Pivot Tables, Complex Formulas (<code>GETPIVOTDATA</code>) and Custom Data Visualization.</li></ol><p>Data is only as good as the decisions it enables. This dashboard transforms<strong style=\"color:navy;\"> “big data” into a clear, actionable story</ strong></p>",
        "mediaType": "video",
        "mediaPath": "assets/videos/accident.mp4"
    }
]